<template>
  <section class="privacy-policy">
    <div class="privacy-policy__w">
      <h1 class="privacy-policy__title">Политика конфиденциальности</h1>
      <ol class="privacy-policy__info">
        <li class="privacy-policy__text">
          Посетитель не может использовать данный сайт неправильно. В частности,
          посетитель не должен влиять и вмешиваться в работу данного сайта или
          получать доступ к информации, опубликованной на данном сайте, не через
          стандартный интерфейс.
        </li>
        <li class="privacy-policy__text">
          Посетитель должен использовать данный сайт исключительно согласно
          нормам действующего законодательства Украины. Если администрация сайта
          обнаружит нарушения посетителем данной ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ И
          УСЛОВИЙ, или заподозрит посетителя в этом, она может приостановить или
          полностью закрыть посетителю доступ к сайту.
        </li>
        <li class="privacy-policy__text">
          <span class="privacy-policy__entepreneur"
            >ФЛП "Сандул Анжела Петровна"</span
          >
          может в любое время пересмотреть данную ПОЛИТИКУ КОНФИДЕНЦИАЛЬНОСТИ И
          УСЛОВИЯ.
        </li>
        <li class="privacy-policy__text">
          Сбор и использование персональных данных:
          <ol class="privacy-policy__info">
            <li class="privacy-policy__text">
              Персональные данные - это сведения или совокупность сведений о
              физическом лице, которое идентифицировано или может быть конкретно
              идентифицировано.
            </li>
            <li class="privacy-policy__text">
              Персональные данные могут быть получены через различные каналы
              связи. В частности, через обслуживание посетителей сайта,
              письменно или по электронной форме на веб-сайте.
            </li>
            <li class="privacy-policy__text">
              Посетителю на сайте
              <a href="#" class="privacy-policy__link">Logicpower.ua</a> может
              быть предложено ввести персональные данные при наличии его
              согласия. В частности, может быть предложено ввести имя, фамилию,
              адрес электронной почты, номер телефона, дату рождения, пол, а
              также зарегистрироваться на сайте с помощью социальных сетей таких
              как Twitter, Facebook .
              <span class="privacy-policy__entepreneur"
                >ФЛП "Сандул Анжела Петровна"</span
              >
              может обращаться к посетителю сайта с просьбой о предоставлении
              других данных.
            </li>
            <li class="privacy-policy__text">
              При регистрации на сайте
              <a href="#" class="privacy-policy__link">Logicpower.ua</a>
              осетитель дает согласие
              <span class="privacy-policy__entepreneur"
                >ФЛП "Сандул Анжела Петровна"</span
              >
              на обработку своих персональных и регистрационных данных. Если
              посетитель принимает решение предоставить свои персональные
              данные, он тем самым дает согласие на передачу и хранение этих
              данных.
            </li>
            <li class="privacy-policy__text">
              <span class="privacy-policy__entepreneur"
                >ФЛП "Сандул Анжела Петровна"</span
              >
            </li>
            <li class="privacy-policy__text">
              Персональные данные посетителей используются для обеспечения
              обмена информацией, отношений в сфере рекламы и коммуникации в
              соответствии с Законами Украины 'О защите персональных данных',
              'Об информации', 'О рекламе', 'О телекоммуникациях', 'О
              предпринимательстве', 'О защите информации в
              информационно-телекоммуникационных системах', НД ТЗИ 2.5-010-03
              'Требования к защите информации WEB-страницы от
              несанкционированного доступа', а также Устава
              <span class="privacy-policy__entepreneur"
                >ФЛП "Сандул Анжела Петровна"</span
              >
              и нормативных актов, регулирующих деятельность
              <span class="privacy-policy__entepreneur"
                >ФЛП "Сандул Анжела Петровна"</span
              >.
            </li>
            <li class="privacy-policy__text">
              Персональные данные посетителей могут храниться в течение 3 лет
              после того, как субъект персональных данных не является
              посетителем сайта
              <a href="#" class="privacy-policy__link">Logicpower.ua</a>.
            </li>
            <li class="privacy-policy__text">
              Сервер
              <span class="privacy-policy__entepreneur"
                >ФЛП "Сандул Анжела Петровна"</span
              >
              временно регистрирует доменное имя или IP - адрес компьютера
              посетителя, а также дату доступа, файлы (имя файла и URL), код
              ответа HTTP и веб-сайт, с которого посетитель попал на сайт
              GREENVISION.UA, количество байт, переданных в ходе сессии.
            </li>
            <li class="privacy-policy__text">
              При работе сайта
              <a href="#" class="privacy-policy__link">Logicpower.ua</a>
              используются файлы cookie . С их помощью возможна идентификация
              браузера посетителя. В данных файлах возможно сохранение настроек
              пользователей и других сведений. Посетитель может настроить
              браузер таким образом, чтобы отклонять все файлы cookie или
              оповещать об их отправке.
            </li>
            <li class="privacy-policy__text">
              <a href="#" class="privacy-policy__link">Logicpower.ua</a>
              безопасным , защищенным и удобным. Файлы cookie обеспечивают
              поддержку функций безопасности и их запуск. Файлы cookie также
              позволяют отслеживать нарушения ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ И
              УСЛОВИЙ посетителями или устройствами. Файлы cookie помогают
              оценить количество и частоту запросов, а также выявлять и
              блокировать тех посетителей или устройства, которые пытаются
              выполнить пакетные загрузки информации с веб-сайта.
            </li>
            <li class="privacy-policy__text">
              С помощью системы Google Analytics
              <span class="privacy-policy__entepreneur"
                >ФЛП "Сандул Анжела Петровна"</span
              >
              собирает статистику о посещении сайта
              <a href="#" class="privacy-policy__link">Logicpower.ua</a>, такую
              как посещаемые страницы,количество просмотров страниц, информацию,
              которая была загружена, домены интернет-провайдеров и страны
              происхождения посетителей, а также адреса веб-сайтов, которые были
              посещены до и после сайта<a href="#" class="privacy-policy__link"
                >Logicpower.ua</a
              >
              и т.д. и т.д. Ни одно из этих действий не связано с посетителем
              лично и измеряется только в совокупности.
            </li>
            <li class="privacy-policy__text">
              Лица в возрасте до 18 лет не имеют права использовать любые услуги
              на сайте
              <a href="#" class="privacy-policy__link">Logicpower.ua</a>, в
              частности регистрацию.
              <span class="privacy-policy__entepreneur"
                >ФЛП "Сандул Анжела Петровна"</span
              >
              никогда намеренно не будет собирать данные о несовершеннолетних,
              не будет использовать их, а также не будет разглашать их третьей
              стороне без соответствующего разрешения.
              <span class="privacy-policy__entepreneur"
                >ФЛП "Сандул Анжела Петровна"</span
              >
              советует родителям и опекунам следить за тем, какие сайты посещают
              их дети.
            </li>
            <li class="privacy-policy__text">
              Сайт
              <a href="#" class="privacy-policy__link">Logicpower.ua</a> может
              использовать сервис защиты от DDOS атак Google Project Shield. Это
              значит, что компания Google Inc. обрабатывать данные, собранные в
              процесси работы Project Shield в соответствии с политикой
              конфиденциальности Goolge Inc.
            </li>
          </ol>
        </li>
        <li class="privacy-policy__text">
          Сайт <a href="#" class="privacy-policy__link">Logicpower.ua</a> может
          содержать ссылки на сайты, которые не управляются ФЛП "Сандул Анжела
          Петровна". Такие ссылки приведены исключительно для информационных
          целей.
        </li>
        <li class="privacy-policy__text">
          Техническое оснащение страниц сайта
          <a href="#" class="privacy-policy__link">Logicpower.ua</a> может
          использовать сервис защиты от DDOS атак Google Project Shield. Это
          значит, что компания Google Inc. обрабатывать данные, собранные в
          процесси работы Project Shield в соответствии с политикой
          конфиденциальности Goolge Inc.
          <ol class="privacy-policy__info">
            <li class="privacy-policy__text">
              Эти модули могут быть кнопками синхронизации аккаунта на сайте
              <a href="#" class="privacy-policy__link">Logicpower.ua</a> Like,
              Рассказать или соответственно "Мне нравится". Если посетитель
              открывал одну из веб-страниц , оснащенную таким плагином, его
              интернет-браузер непосредственно подключит его к серверам
              Facebook, Twitter, LinkedIn, Google+ или Youtube. Плагин будет
              передавать на сервер данные о том, какие именно веб-страницы сайта
              <a href="#" class="privacy-policy__link">Logicpower.ua</a>
              посетитель просматривал.
            </li>
            <li class="privacy-policy__text">
              При использовании любых функций плагина, эта информация также
              будет синхронизирована с учетной записью посетителя на Facebook,
              Twitter, LinkedIn, , Google+ или Youtube. Более подробную
              информацию о сборе и использовании данных сетями Facebook,
              Twitter, LinkedIn, , Google+ или Youtube, а также о правах и
              возможностях по защите персональных данных в данном контексте
              можно найти в разделе о конфиденциальности на сайтах Facebook,
              Twitter, LinkedIn, , Google+ или Youtube.
            </li>
            <li class="privacy-policy__text">
              Во избежание связи сетей Facebook, Twitter, LinkedIn, Google+ или
              Youtube с сайтом
              <a href="#" class="privacy-policy__link">Logicpower.ua</a> и
              последующего соотнесения данной информации с аккаунтом, посетитель
              должен выйти из учетной записи сети перед посещением сайта
              <a href="#" class="privacy-policy__link">Logicpower.ua</a>.
            </li>
          </ol>
        </li>
        <li class="privacy-policy__text">
          Сведения о трафике, который проходит через сеть ФЛП 'Сандул Анжела
          Петровна', по электронной почте, и активность клиентов в сети Интернет
          на сайте
          <a href="#" class="privacy-policy__link">Logicpower.ua</a> защищены в
          соответствии с законодательством. Это означает, что ФЛП 'Сандул Анжела
          Петровна' и его сотрудники не могут вмешиваться в тайну
          телекоммуникаций.
        </li>
        <li class="privacy-policy__text">
          <span class="privacy-policy__entepreneur"
            >ФЛП "Сандул Анжела Петровна"</span
          >
          имеет право предоставить любую личную информацию посетителей сайта
          <a href="#" class="privacy-policy__link">Logicpower.ua</a> по
          требованию правоохранительных органов, по решению/постановлению суда
          или в рамках других законных процедур, или по другому требованию
          согласно действующему законодательству Украины.
        </li>
        <li class="privacy-policy__text">
          <span class="privacy-policy__entepreneur"
            >ФЛП "Сандул Анжела Петровна"</span
          >
          не несет ответственности за упущенную выгоду или упущенную прибыль,
          недополученный доход, потерю данных или любые другие убытки
          посетителей сайта
          <a href="#" class="privacy-policy__link">Logicpower.ua</a>, если
          таковые возникли при пользовании сайта
          <a href="#" class="privacy-policy__link">Logicpower.ua</a>.
        </li>
        <li class="privacy-policy__text">
          <span class="privacy-policy__entepreneur"
            >ФЛП "Сандул Анжела Петровна"</span
          >
          не гарантирует и не утверждает, что использование материала, который
          предоставляется на сайте
          <a href="#" class="privacy-policy__link">Logicpower.ua</a> не повредит
          интересам третьих лиц.
          <a href="#" class="privacy-policy__link">Logicpower.ua</a> не повредит
          интересам третьих лиц.
        </li>
        <li class="privacy-policy__text">
          <span class="privacy-policy__entepreneur"
            >ФЛП "Сандул Анжела Петровна"</span
          >
          принимает меры, чтобы информация на сайте
          <a href="#" class="privacy-policy__link">Logicpower.ua</a> была
          достоверной. Однако
          <span class="privacy-policy__entepreneur"
            >ФЛП "Сандул Анжела Петровна"</span
          >
          не берет на себя ответственность и не гарантирует, что предоставленная
          информация и данные являются точными, объективными и актуальными на
          момент просмотра.
        </li>
        <li class="privacy-policy__text">
          Авторские материалы, опубликованные на сайте Logicpower.us, являются
          точкой зрения журналистов, не является нормой и не должны так
          толковаться.
          <span class="privacy-policy__entepreneur"
            >ФЛП "Сандул Анжела Петровна"</span
          >
          не несет ответственности за точность, объективность и актуальность
          информации, опубликованной на сайте"Сандул Анжела Петровна" не несет
          ответственности за точность, объективность и актуальность информации,
          опубликованной на сайте
          <a href="#" class="privacy-policy__link">Logicpower.ua</a> в
          частности, со ссылкой на другие источники.
        </li>
        <li class="privacy-policy__text">
          Все права на сайт
          <a href="#" class="privacy-policy__link">Logicpower.ua</a> и его
          содержание принадлежат
          <span class="privacy-policy__entepreneur"
            >ФЛП "Сандул Анжела Петровна"</span
          >
          или используются ФЛП и его содержание принадлежат ФЛП по согласованию
          с правообладателями. Данный сайт в целом, и отдельные его элементы
          охраняются Законом Украины "Об авторском праве и смежных правах",
          Международными правовыми актами и другими актами действующего
          законодательства Украины.
        </li>
        <li class="privacy-policy__text">
          Посетители сайта не должны распространять, изменять, передавать,
          использовать или использовать повторно любую информацию с сайта
          <a href="#" class="privacy-policy__link">Logicpower.ua</a> для любой
          публичной или коммерческой цели без письменного разрешения ФЛП "Сандул
          Анжела Петровна". Посетители должны соблюдать все авторские права и
          другие примечания о собственности на загруженные и/или копируемые
          материалы. Скопированная информация должна содержать активную
          гиперссылку на сайт
          <a href="#" class="privacy-policy__link">Logicpower.ua</a>.
        </li>
        <li class="privacy-policy__text">
          Копирование информации с сайта
          <a href="#" class="privacy-policy__link">Logicpower.ua</a> может быть
          осуществлено в некоммерческих целях для размещения на страницах
          пользователя, в блогах, социальных сетях.
        </li>
        <li class="privacy-policy__text">
          Использование посетителем сайта
          <a href="#" class="privacy-policy__link">Logicpower.ua</a>. A
          происходит на собственный риск пользователя. В пределах, которые
          максимально позволяет закон, ни
          <span class="privacy-policy__entepreneur"
            >ФЛП "Сандул Анжела Петровна"</span
          >, ни любая другая сторона, вовлеченная в создание, производство или
          обслуживание сайта
          <a href="#" class="privacy-policy__link">Logicpower.ua</a>, не несет
          ответственности за прямые, косвенные или случайные убытки, которые
          когда-либо причинялись, и которые были вызваны тем, что посетитель
          имел доступ к сайту
          <a href="#" class="privacy-policy__link">Logicpower.ua</a>,
          пользовался им или надеялся на него, даже если ФЛП "Сандул Анжела
          Петровна" предупреждало посетителя о возможности таких убытков и
          потерь.
        </li>
        <li class="privacy-policy__text">
          <span class="privacy-policy__entepreneur"
            >ФЛП "Сандул Анжела Петровна"</span
          >
          ни в коем случае не будет причастна к одной из сторон прямого,
          косвенного, преднамеренного или непреднамеренного нанесения убытков за
          любое использование сайта
          <a href="#" class="privacy-policy__link">Logicpower.ua</a>, или на
          любом другом взаимосвязанном сайте включая, без ограничения, любую
          потерю доходов, гудвила, потерю программ или других данных в системе
          обработки информации посетителя, даже если ФЛП "Сандул Анжела
          Петровна" было быстро проинформирован о возможности таких убытков.
        </li>
        <li class="privacy-policy__text">
          При работе с сайтом
          <a href="#" class="privacy-policy__link">Logicpower.ua</a> посетителю
          не предоставляются права на интеллектуальную собственность ни на один
          сайт, ни на его содержание или на использование каких-либо элементов
          брендинга или логотипов сайта
          <a href="#" class="privacy-policy__link">Logicpower.ua</a>.
        </li>
        <li class="privacy-policy__text">
          Якщо Ви відвідали цей сайт, Ви автоматично погоджуєтеся з цією
          ПОЛІТИКОЮ КОНФІДЕНЦІЙНОСТІ ТА УМОВАМИ. Якщо Ви не згодні з даною
          ПОЛІТИКОЮ КОНФІДЕНЦІЙНОСТІ ТА УМОВАМИ, Ви повинні покинути цей сайт.
        </li>
      </ol>
    </div>
  </section>
</template>

<script lang="ts">
import {Component, Vue } from "~/tools/version-types";

@Component({})
export default class PrivacyPolicyComponent extends Vue {}
</script>

<style lang="scss">
.privacy-policy {
  @extend %flex-column;
  align-items: center;

  @extend %padding-wrp;
  padding-bottom: 80px;

  &__w {
    @extend %width-content;
    @extend %flex-column;
    gap: 54px;
  }

  &__title {
    @include fontUnify(42, 50, 700);
    text-align: center;
    text-transform: uppercase;

    @include mobile {
      @include fontUnify(24, 34, 700);
      letter-spacing: 0.02em;
    }
  }

  &__info {
    @include fontUnify(18, 24);
    letter-spacing: 0.02em;

    list-style: none;
    counter-reset: li;

    & > li > ol {
      padding-top: 16px;
      padding-left: 16px;
    }

    @include mobile {
      @include fontUnify;
    }
  }

  &__link {
    color: $color-main;
  }

  &__entepreneur {
    font-weight: 700;
  }

  &__text {
    margin-bottom: 16px;

    &:last-child {
      margin: 0;
    }

    &:before {
      counter-increment: li;
      content: counters(li, ".") ".";
      margin-right: 4px;
    }
  }
}
</style>
